INSERT INTO book (name, image, price, description, publishing_house, age_limit, page_size, date_of_writing)
VALUES ('Мастер и Маргарита',
        'https://cdn1.ozone.ru/s3/multimedia-x/6597669093.jpg',
        550,
        'В Москве 1930-х годов разворачивается мистическая история о дьяволе Воланде и его свите, которые вмешиваются в жизнь обычных москвичей. Параллельно развивается трагическая история любви Мастера, писателя, создавшего роман о Понтии Пилате, и его возлюбленной Маргариты. Роман переплетает в себе мистику, сатиру, любовь и философию, ставя вечные вопросы о добре и зле, вере и неверии.',
        'Азбука', 16, 400, '1967-01-01'),
       ('1984',
        'https://avatars.dzeninfra.ru/get-zen_doc/271828/pub_666075854fc4f4686c86b7cc_6660767f4fc4f4686c893226/scale_1200',
        400,
        'В антиутопическом государстве Океания, управляемом Партией, царит тотальный контроль и слежка. Главный герой, Уинстон Смит, работает в Министерстве Правды и занимается фальсификацией истории. Он начинает бунтовать против системы, влюбляется в Джулию и присоединяется к подпольной организации, но вскоре сталкивается с жестокой реальностью тоталитаризма.',
        'Эксмо', 16, 320, '1949-06-08'),
       ('Убить пересмешника', 'https://avatars.mds.yandex.net/get-mpic/6256254/img_id9117398437172477107.jpeg/orig',
        480,
        'Сюжет разворачивается вокруг судьбы Гая Монтэга, пожарного, который живет в обществе, где книги запрещены и подлежат сожжению. Он сталкивается с молодой девушкой, которая открывает ему мир книг, и начинает сомневаться в правильности своего существования. Гай начинает читать, открывает для себя истину и становится борцом за свободу мысли.',
        'АСТ', 18, 576, '1960-04-29'),
       ('Гарри Поттер и философский камень',
        'https://avatars.mds.yandex.net/get-mpic/5057162/2a0000018fa647354505c059d8db08c43cc7/orig',
        700,
        'Гарри Поттер, осиротевший мальчик, узнает, что он волшебник и приглашен в школу чародейства и волшебства Хогвартс. Там он находит верных друзей, сталкивается со злом в лице Лорда Волан-де-Морта и начинает борьбу за свою жизнь и будущее магического мира, раскрывая тайны своего прошлого.',
        'Росмен', 12, 432, '1997-06-26'
       ),
       ('Хоббит, или Туда и обратно',
        'https://avatars.mds.yandex.net/get-mpic/1715213/img_id2395864502561941587.jpeg/orig',
        600,
        'Хоббит Бильбо Бэггинс, живущий мирной жизнью, неожиданно отправляется в опасное путешествие с группой гномов. Им нужно вернуть сокровища, украденные драконом Смогом. Путешествие полно опасностей, встреч с эльфами, гоблинами, и другими волшебными существами. Бильбо находит кольцо, которое изменит его жизнь навсегда.',
        'Азбука', 10, 384, '1937-09-21'
       ),
       ('Преступление и наказание', 'https://static10.labirint.ru/books/155640/cover.jpg',
        500,
        'Бывший студент Родион Раскольников, измученный нищетой и теорией "сверхчеловека", совершает убийство старухи-процентщицы и ее сестры. После этого он мучается от угрызений совести, вступает в психологическую игру со следователем Порфирием Петровичем и проходит через духовные страдания, пытаясь понять, что на самом деле есть преступление и наказание.',
        'Эксмо', 16, 672, '1866-01-01'
       ),
       ('Война и мир', 'https://avatars.mds.yandex.net/get-mpic/1636931/img_id6572990686330337003.jpeg/orig',
        800,
        'Действие романа происходит в России в начале XIX века, во времена наполеоновских войн. Роман рассказывает о судьбах нескольких дворянских семей, прослеживая их жизни на фоне исторических событий. Любовь, дружба, война, предательство и поиски смысла жизни - главные темы этого эпического произведения.',
        'АСТ', 16, 1280, '1869-01-01'
       ),
       ('Темная Башня. Стрелок', 'https://cdn1.ozone.ru/s3/multimedia-1-u/6947952042.jpg',
        550,
        'Роланд Дискейн, последний из рода стрелков, отправляется в опасное путешествие по миру, стоящему на грани гибели. Он стремится достичь Темной Башни, центра всех миров. На своем пути он встречает друзей и врагов, сражается с монстрами и раскрывает тайны своего мира.',
        'АСТ', 16, 816, '1982-01-01'
       ),
       ('Соавторы', 'https://avatars.mds.yandex.net/get-mpic/5320264/img_id5486358515785628628.jpeg/orig',
        650,
        'Двое друзей, ангел Азирафаэль и демон Кроули, объединяются, чтобы предотвратить приближающийся конец света. Они объединяются, чтобы найти Антихриста, который был подменен в младенчестве. Вместе они проходят через множество смешных и опасных ситуаций, доказывая, что дружба и доброта могут победить любые пророчества.',
        'Неизвестно', 14, 352, '1990-05-01'
       ),
       ('Добрые предзнаменования',
        'https://avatars.mds.yandex.net/get-mpic/1545401/img_id6818078447695322817.jpeg/orig',
        750,
        'Юная волшебница Тиффани Болит отправляется защищать своих близких от Королевы эльфов. Ей помогают маленькие, но очень отважные существа - нак-мак-фиглы. Путешествие в мир эльфов, битва с могущественными врагами и вера в себя помогут Тиффани стать сильной волшебницей.',
        'Азбука', 14, 416, '1990-05-01'
        );


INSERT INTO genre (name)
VALUES ('Фантастика'),
       ('Роман'),
       ('Классика'),
       ('Детектив'),
       ('Фэнтези'),
       ('Ужасы');

INSERT INTO author (name)
VALUES ('Михаил Булгаков'),
       ('Джордж Оруэлл'),
       ('Харпер Ли'),
       ('Джоан Роулинг'),
       ('Джон Р.Р. Толкин'),
       ('Федор Достоевский'),
       ('Лев Толстой'),
       ('Стивен Кинг'),
       ('Нил Гейман'),
       ('Терри Пратчетт'),
       ('Илья Ильф'),
       ('Евгений Петров');

INSERT INTO list_of_authors (book_id, author_id)
VALUES (1, 1),   -- Мастер и Маргарита, Михаил Булгаков
       (2, 2),   -- 1984, Джордж Оруэлл
       (3, 3),   -- Убить пересмешника, Харпер Ли
       (4, 4),   -- Гарри Поттер, Джоан Роулинг
       (5, 5),   -- Хоббит, Джон Р.Р. Толкин
       (6, 6),   -- Преступление и наказание, Федор Достоевский
       (7, 7),   -- Война и мир, Лев Толстой
       (8, 8),   -- Темная Башня. Стрелок, Стивен Кинг
       (9, 1),   -- Соавторы (привязываем Булгакова для примера. Замените на реальных авторов)
       (9, 8),   -- Соавторы, Стивен Кинг (привязываем Кинга для примера. Замените на реальных авторов)
       (10, 9),  -- Добрые предзнаменования, Нил Гейман
       (10, 10),-- Добрые предзнаменования, Терри Пратчетт
       (10, 11), -- Добрые предзнаменования, Илья Ильф(привязываем Ильфа для примера. Замените на реальных авторов)
       (10, 12); -- Добрые предзнаменования, Евгений Петров


INSERT INTO list_of_genres (book_id, genre_id)
VALUES (1, 2), -- Мастер и Маргарита, Роман
       (1, 1), -- Мастер и Маргарита, Фантастика
       (2, 1), -- 1984, Фантастика
       (2, 2), -- 1984, Роман
       (3, 2), -- Убить пересмешника, Роман
       (3, 3), -- Убить пересмешника, Классика
       (4, 5), -- Гарри Поттер, Фэнтези
       (5, 5), -- Хоббит, Фэнтези
       (6, 2), -- Преступление и наказание, Роман
       (6, 3), -- Преступление и наказание, Классика
       (7, 2), -- Война и мир, Роман
       (7, 3), -- Война и мир, Классика
       (8, 1), -- Темная Башня. Стрелок, Фантастика
       (8, 6); -- Темная Башня. Стрелок, Ужасы
